<b> Pandas Basics <b>

In [1]:
import pandas as pd 
import numpy as np

In [2]:
pd.__version__

'1.1.3'

<b> Series </b>

In [4]:
dict = { "one" : [1,2,3,4]}

In [5]:
dict

{'one': [1, 2, 3, 4]}

In [6]:
my_series = pd.Series(dict)

In [7]:
type(my_series)

pandas.core.series.Series

In [8]:
my_series

one    [1, 2, 3, 4]
dtype: object

In [9]:
my_series.index

Index(['one'], dtype='object')

In [10]:
a1 = np.random.randint(5,size=5)

In [11]:
a1

array([2, 1, 0, 3, 2])

In [12]:
series = pd.Series(a1)

In [13]:
type(series)

pandas.core.series.Series

In [14]:
series

0    2
1    1
2    0
3    3
4    2
dtype: int32

In [18]:
a1 = np.random.randint(5,size=5)
series1 = pd.Series(a1, index=['a','b','c','d','e'])
series1

a    4
b    4
c    2
d    0
e    2
dtype: int32

In [20]:
series1['a']

4

<b> Data Frame </b>

In [21]:
dict = { "id" : [1,2,3,4], "name" : ["a","b","c","d"] }
dict

{'id': [1, 2, 3, 4], 'name': ['a', 'b', 'c', 'd']}

In [22]:
df = pd.DataFrame(dict)

In [23]:
df

   id name
0   1    a
1   2    b
2   3    c
3   4    d

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
df.columns

Index(['id', 'name'], dtype='object')

In [26]:
df.dtypes

id       int64
name    object
dtype: object

In [27]:
s1 = pd.Series([1,2,3,4], name = "id")
s2 = pd.Series(['a','b','c','d'], name = "name")
s3 = pd.Series([True,False,False,True], name = "working")
s4 = pd.Series([1.2,2.4,3.7,4.5], name = "experience")

In [28]:
serieses = [ s1,s2,s3,s4] 
x = pd.DataFrame(serieses)

In [29]:
x

               0      1      2     3
id             1      2      3     4
name           a      b      c     d
working     True  False  False  True
experience   1.2    2.4    3.7   4.5

In [30]:
x.T

  id name working experience
0  1    a    True        1.2
1  2    b   False        2.4
2  3    c   False        3.7
3  4    d    True        4.5

<b> Reading Files </b>

In [33]:
df = pd.read_csv("students.csv")

In [34]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [35]:
type(df)

pandas.core.frame.DataFrame

In [36]:
df_excel = pd.read_excel("students.xlsx")

In [37]:
df_excel

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
1   2    B   4       9   23      21
2   3    C   3       6   12      23
3   4    D   4       2   23      23
4   5    E   1       7   11      11

In [38]:
type(df_excel)

pandas.core.frame.DataFrame

In [39]:
df_excel.columns

Index(['id', 'name', 'q1', 'assign', 'mid', 'compre'], dtype='object')

<b> Write to a file </b>

In [40]:
df_excel

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
1   2    B   4       9   23      21
2   3    C   3       6   12      23
3   4    D   4       2   23      23
4   5    E   1       7   11      11

In [41]:
df_excel.to_csv("my_first_data_Writing.csv")

<b> Data Selection </b>

In [42]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [43]:
name = df["name"]

In [44]:
name

0    pravin
1     patil
2      john
3     sadiq
4    pravin
Name: name, dtype: object

In [45]:
type(name)

pandas.core.series.Series

In [46]:
list_of_col = ["id", "name", "compre"]
extracted_data = df[list_of_col]

In [47]:
extracted_data

   id    name  compre
0   1  pravin      34
1   2   patil       4
2   3    john      33
3   4   sadiq      11
4   5  pravin      34

In [48]:
type(extracted_data)

pandas.core.frame.DataFrame

In [50]:
id = extracted_data["id"]

In [51]:
type(id)

pandas.core.series.Series

In [52]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [53]:
df.columns

Index(['id', 'name', 'quiz1', 'quiz2', 'assignment', 'midsem', 'compre'], dtype='object')

In [54]:
df.head()

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [55]:
df.head(2)

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4

In [56]:
df.tail(2)

   id    name  quiz1  quiz2  assignment  midsem  compre
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [57]:
df.describe

<bound method NDFrame.describe of    id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34>

In [58]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [59]:
df.iloc[0]

id                 1
name          pravin
quiz1              5
quiz2              5
assignment        10
midsem            22
compre            34
Name: 0, dtype: object

In [61]:
df.iloc[1, 1]

'patil'

In [62]:
df.loc[0]

id                 1
name          pravin
quiz1              5
quiz2              5
assignment        10
midsem            22
compre            34
Name: 0, dtype: object

In [63]:
df.loc[1, "id"]

2

In [64]:
df.loc[1, "name"]

'patil'

In [65]:
df.loc[0:3, ["id","name"]]

   id    name
0   1  pravin
1   2   patil
2   3    john
3   4   sadiq

In [66]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [70]:
df[df["quiz1"] > 3]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [68]:
df["quiz1"]

0    5
1    5
2    3
3    5
4    5
Name: quiz1, dtype: int64

In [69]:
df.quiz1

0    5
1    5
2    3
3    5
4    5
Name: quiz1, dtype: int64

In [75]:
df[(df.quiz1 > 3) & (df.assignment > 7)]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
4   5  pravin      5      5          10      22      34

In [72]:
df[(df.quiz1 > 3) | (df.assignment > 7)]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [73]:
df[(df.quiz1 == 3) | (df.assignment > 7)]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
4   5  pravin      5      5          10      22      34

In [76]:
df.query('quiz1 > 3')

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34